"""
Создать переменную содержащую сторону квадрата, создать новый список,
в котором будут периметр квадрата, площадь квадрата и диагональ квадрата.
"""

my_st = 7

my_list = [my_st * 4, my_st * my_st, (my_st ** 2 * 2) ** 0.5]

print(my_list)
