"""
Создать три переменные, содержащие возраст трех ваших друзей,
в качестве имен переменных использовать имена друзей,
найти сумму и вывести ее на экран.
"""

alex_age = 36
bob_age = 30
carl_age = 28

result = alex_age + bob_age + carl_age
print(result)

avg_age = (alex_age + bob_age + carl_age) / 3
print(avg_age)
